//* Розгалуження: if, if...else, else...if
//TODO: 1 ===================================
//Даний рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// -----------------------

// const str = "abcde";
// if (str[0] === "a") {
//   console.log("Yes, this is a");
// } else {
//   console.log("No,this isn't a");
// }

//TODO: 2 ===================================
// Написати скрипт, який перевіряє чи введене число через prompt потрапляє в діапазон від 55 до 99 включно.
// Якщо так, вивести в консоль "Число потрапляє в діапазон".
// Якщо ні, вивести в консоль "Число не потрапляє в діапазон".

// const value = 73;

// -----------------------

// if (value >= 55 && value <= 99) {
//   console.log("This number is true");
// } else {
//   console.log("This number is false");
// }

//TODO: 3 ===================================
// Є 3 вікові групи : діти (0-16), дорослі(17-60), пенсіонери (61-100).
// До якої групи відноситься Максим, якщо йому 55 років.Назву групи вивести на екран.

// const ageMaxim = 55;

// -----------------------
// const ageMaxim = 55;

// if (ageMaxim >= 0 && ageMaxim <= 16) {
//   console.log("The children");
// } else if (ageMaxim >= 17 && ageMaxim <= 60) {
//   console.log("The adult");
// } else if (ageMaxim >= 61 && ageMaxim <= 100) {
//   console.log("The pensioner");
// } else {
//   console.log("Not human");
// }

//TODO: 4 ===================================
//* Конструкція switch
// Запитай користувача у модальному вікні, який з напоїв він бажає придбати - "Кава", "Чай" чи "Сік",
// та залежно від виду напою оголоси суму досплати.Використовувати switch.

// -----------------

// const drink = prompt(
//   "Which drink choose client:tea, juice, coffe"
// ).toLowerCase();

// function orderDrink(drink) {
//   let price = 0;
//   switch (drink) {
//     case "Coffee":
//       price = 50;
//       break;
//     case "Tea":
//       price = 40;
//       break;
//     case "Juice":
//       price = 30;
//       break;

//     default:
//       break;
//   }
// }

// TODO: 5 ===================================
// Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо відвідувач ввів інше число - попросити
// ввести ще раз і так далі.
// Цикл має питати число, поки відвідувач не
// введе число більше 100, або натисне кнопку
// скасування в prompt

//TODO: 6 ===================================
// Знайдіть число 49  у проміжку чисел від 1 до 100 та вийдіть з циклу.

// ! Масиви і функції
//TODO:=========task-01=================
// Створіть масив styles з елементами «Джаз» та «Блюз».
// Додайте "Рок-н-рол" в кінець.
// Замініть значення "Блюз" на "Класика".
// Видалить перший елемент масиву і виведіть його в консоль.
// Вставте «Реп» і «Реггі» на початок масиву.

//TODO:=============task-02=================
// напиши функцію яка сумуватиме сусідні числа і пушити в новий масив

// const someArr = [22, 11, 34, 5, 12, 13, 14, 15];

//TODO:=============task-3=================
// Написати функцію, яка приймає рядок і повертає кількість голосних літер у цьому рядку. `Містить ${count} голосних`

//TODO:=========task-5=================
// Перевірити, чи містить масив заданий елемент. Якщо містить, видалити його, якщо ні - додати в кінець масиву.

// const wordsArray = ['JavaScript', 'HTML', 'CSS'];
