//* Розгалуження: if, if...else, else...if
//TODO: 1 ===================================
//Даний рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.
// const str = "abcde";

// if (str[0] === "a") {
// console.log ("yes")
// } else {
//     console.log ("not")
// }

// const srt1 = str[0]=== "a" ? console.log("yes") : console.log("not")
// str.startsWith("c") ? console.log("yes") : console.log("not")

//TODO: 2 ===================================
// Написати скрипт, який перевіряє чи введене число через prompt потрапляє в діапазон від 55 до 99 включно.
// Якщо так, вивести в консоль "Число потрапляє в діапазон".
// Якщо ні, вивести в консоль "Число не потрапляє в діапазон".

// const value = 73;

// if (value >= 55 && value <= 99) {
//     console.log("Число потрапляє в діапазон");
// }else {
//     console.log("Число не потрапляє в діапазон");
// }

// value >= 55 && value <= 99 ? console.log("Число потрапляє в діапазон") : console.log("Число не потрапляє в діапазон")